mfrknycl/EVCS_v0.3_with_STM32CubeIDE/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define TEMP_ALERT_Pin GPIO_PIN_0
#define TEMP_ALERT_GPIO_Port GPIOC
#define CAP_ALERT_Pin GPIO_PIN_1
#define CAP_ALERT_GPIO_Port GPIOC
#define Sense_Out_Pin GPIO_PIN_2
#define Sense_Out_GPIO_Port GPIOC
#define GFCI_INT_Pin GPIO_PIN_3
#define GFCI_INT_GPIO_Port GPIOC
#define FEEDBACK_Pin GPIO_PIN_0
#define FEEDBACK_GPIO_Port GPIOA
#define GFCI_TEST_Pin GPIO_PIN_1
#define GFCI_TEST_GPIO_Port GPIOA
#define ACS_VOUT_Pin GPIO_PIN_4
#define ACS_VOUT_GPIO_Port GPIOA
#define LED_Pin GPIO_PIN_5
#define LED_GPIO_Port GPIOA
#define CONTROL_PIN_Pin GPIO_PIN_6
#define CONTROL_PIN_GPIO_Port GPIOA
#define RLY1_Pin GPIO_PIN_6
#define RLY1_GPIO_Port GPIOC
#define NEW_LED_Pin GPIO_PIN_7
#define NEW_LED_GPIO_Port GPIOF
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
